//
//  Data.swift
//  00657131hww2
//
//  Created by User08 on 2019/10/19.
//  Copyright © 2019 ntou. All rights reserved.
//

import Foundation
let menus=[

Menu(image:"a1",name:"珍珠伯爵奶茶卡士達塔",pic:["a2","a3","a4","a5","a6","a7"],material:"塔殼(約12個)\n低筋麵粉 180g 烘焙用杏仁粉 65g 糖粉 50g 鹽 1/2匙  無鹽奶油 85g 全蛋 1顆\n伯爵奶茶卡士達醬\n牛奶 200g 細白砂糖 40g 全蛋 1顆 動物性鮮奶油 200g 伯爵紅茶茶包 2~3包 麵粉 17g 無鹽奶油 17g 蘭姆酒(可不加) 適量 市售黑糖珍珠 適量",introduce:"1過篩所有粉類與鹽混合，加入切成小塊的冰奶油，混入蛋液後用刮刀以切扮方式均勻，用保鮮膜包起冷藏至少30分，取出桿平塞入塔模中整型，底部用叉子戳洞，放入180度預熱過的烤箱，烘烤約20~25分鐘後即可取出放涼。\n 2製作伯爵奶茶卡士達醬：蛋和砂糖打散後加入茶包泡的茶水(約10cc)，茶包剪開放入約1包量的茶葉拌勻(可視喜好調整茶包用量)。\n 3加入牛奶和鮮奶油後隔水加熱並攪拌均勻，篩入麵粉拌勻後再過篩(確保麵粉顆粒不會殘留)，待隔水加熱攪拌至濃稠時，加入無鹽奶油和蘭姆酒拌勻，離火放涼。\n     4奶茶餡放入冷藏至少1小時，即可開始組裝。\n                                 5將奶茶餡填入塔殼中近8~9分滿，放上適量珍珠就完成囉!!\n                6這款珍珠伯爵奶茶卡士達塔，多了茶葉讓香氣較明顯，也讓珍珠奶茶塔層次更提升了些呢^^"),
Menu(image:"b1",name:"抹茶舒芙蕾乳酪蛋糕",pic:["b2","b3","b4","b5","b6","b7"],material:"蛋糕麵糊\n奶油乳酪 180g 無鹽奶油 30g 牛奶 75ml 砂糖 45g 蛋黃 3 低筋麵粉 30g 玉米粉 10g 抹茶粉 10g\n蛋白霜\n蛋白 3 砂糖 30g 抹茶粉 10g",introduce:"1用奶油塗抹蛋糕模，並在底部和週圍舖上烘焙紙.請務必將底部和側面完全包裹鋁箔紙，以防止水進烤模.\n烤箱預熱至160°C / 320°F.\n在一個大碗放在熱水中，放入奶油奶酪, 無鹽奶油,牛奶和砂糖 隔著熱水攪拌,直到混合均勻並光滑, 就可以從熱水中移開\n3蛋黃一次一個加入\n4加入過筛後的麵粉,玉米粉和抹茶粉, 混合均匀\n5在另一個大碗裡，用手動攪拌器打蛋白.當蛋白呈泡沫狀時,砂糖分次加入.打至蛋白霜尾端可成現彎曲狀態就可以\n6蛋白霜分3次加入蛋糕麵糊,輕輕的攪拌,直到蛋糕麵糊均勻混合。\n                         7將蛋糕麵糊倒入蛋糕模,並將蛋糕模在桌上輕敲幾下以釋放氣泡\n                                                          8用水浴法烘烤蛋糕,160°C / 320°F 烘烤15分鐘.\n然後140°C / 275°F\n 烘烤35-40分鐘.當蛋糕烘烤完成後不要急著把蛋糕出爐,關掉烤箱後,稍微打開一點烤箱門，讓蛋糕在烤箱中大約30分鐘10撒滿抹茶粉在蛋糕上\n"),
Menu(image:"c1",name:"古早味蛋糕",pic:["c2","c3","c4","c5","c6","c7"],material:"沙拉油 75g 低筋麵粉 90g 蛋 6顆 牛奶 60g 糖 70g 鹽 1g",introduce:"1沙拉油加熱加入低筋麵粉拌勻\n2牛奶加入步驟1拌勻，再加入蛋黃攪拌均勻即可\n3蛋白打發，糖粉+鹽三次加入，打發至濕性發泡\n4取1/3的蛋白霜與蛋黃糊稍微攪拌後倒入蛋白霜中攪拌均勻，勿過度攪拌\n5麵糊倒入烤模中，隔水加熱，烤焙約60~70分鐘(依實際狀況調整)\n"),
Menu(image:"d1",name:"抹茶紅豆鐵鍋鬆餅",pic:["d2","d3","d4","d5","d6","d7"],material:"鬆餅\n鬆餅粉 200g 牛奶 100~120ml 雞蛋 一顆 抹茶粉 適量 食用油 適量 鑄鐵鍋(如無平底鍋亦可) 一只\n抹茶鮮奶油\n鮮奶油 200ml 砂糖 20g 抹茶粉 適量 蜜紅豆(市售或事先煮好) 適量",introduce:"1準備食材(此份量約可做6~8片，可做成二份抹茶紅豆鬆餅)。\n2蛋打散後加入牛奶及抹茶粉，分次加入鬆餅粉攪拌均勻。\n(因為要做美式鬆餅建議多些牛奶調稀一點)\n3熱鍋後抹點油，放入一勺鬆餅糊使之慢慢攤平成圓形，待表面冒泡時翻面煎至表面金黃即可起鍋。\n4接著打發鮮奶油 : 將鮮奶油和抹茶放入鋼盆中，以電動攪拌器中速攪拌，分次加入砂糖打至鮮奶油稍微會垂下的狀態即可。\n5將鬆餅逐片擺放在鐵鍋中(盤子亦可)，中間塗抹一些抹茶鮮奶油，最後放上一大匙蜜紅豆。\n6抹茶紅豆鬆餅就完成啦!!\n加了抹茶的鬆餅很好吃，搭配抹茶鮮奶油與蜜紅豆更為清爽呢^^"),
Menu(image:"e1", name:"香濃可口的布丁",pic:["e2","e3","e4","e5","e6","e7"],material:"布丁醬\n牛奶 300ml 細白糖 55g 蛋（中顆） 2個 蛋黃 1個 香草精 少許\n焦糖醬\n細白糖 50g 水 1茶匙 滾水 1大匙",introduce:"1首先來做焦糖的部分。在鍋中放入細白糖及水，開中火，用刮棒攪拌。加熱中會慢慢變成褐色。\n開始起泡後，會飄出煙及焦糖香後，熄火，加入一大匙滾水。（注意焦糖會噴喔！)\n2然後將煮好的焦糖放入容器中，送入冰箱冷藏定型。\n3接著做布丁的身體。先在鍋中放入牛奶及細白糖，開中火一邊煮一邊攪拌，在沸騰的前一個瞬間熄火。\n4在盆中加入2顆蛋及1顆蛋黃及香草精，接著攪拌。\n5再來分次加入溫牛奶，不斷攪拌。最後加入香草精，攪拌混合。\n＊如果直接將步驟5的溫牛奶一次放入，就會造成盆中的蛋變成固態，一定要慢慢的一邊攪拌一遍加入喔！\n6接著將混合好的布丁加入剛剛放進冰箱冷藏的容器內。\n7取一個大的平底鍋，加入熱水（布丁容器的一半高），接著將布丁排好。\n蓋上蓋子後，小火煮10分鐘後熄火。不要打該蓋子，放置10-15分鐘，利用餘溫繼續加熱。\n布丁的表面就可以有ＱＱ的彈性，如果你擔心中間沒有熟，可以用牙籤插一下做確認。\n8做好的布丁放涼後，送入冰箱冷藏2-3小時，就可以將布丁倒扣擺盤。"),
Menu(image:"f1", name:"半熟起司塔",pic:["f2","f3","f4","f5","f6","f7"],material:"市售現成塔殼 8個 馬斯卡彭Mascarpone 100g Cheese cream 150g 鮮奶油 50ml 鮮奶 50ml 砂糖 50g 檸檬汁 10c.c. 玉米粉 8g 蛋黃(表面上色用) 一顆",introduce:"1先將塔殼放入烤箱，以150度上下火烤約5~8分鐘，表面稍微上色即可取出放涼備用。\n2馬斯卡彭與Cheesecream放入大碗或鋼盆中，加入鮮奶油及鮮奶攪拌。\n3準備一盆熱水，以隔水加熱方式攪拌乳酪餡，最後加入檸檬汁、砂糖及玉米粉全部材料混合均勻至柔滑狀。\n4將乳酪餡填入塔殼中，可用篩網使之更細緻。填滿後放入冷凍庫中，冰凍約1~2小時。\n5烤箱以170度預熱，將起司塔從冷凍庫取出，表面刷上蛋黃液。\n6放入烤箱烤約10~20分鐘，再轉上火烤約5分鐘即可\n(每台烤箱功率不同，請自行斟酌時間及溫度)。\n7超美味的人氣點心 - 半熟起司塔完成!!")]
